import 'package:flutter/material.dart';
class bagerhat extends StatelessWidget {
  const bagerhat({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: Text('বাগেরহাট জেলার ইতিহাস'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(18.0),
        child: SingleChildScrollView(
          child: Column(
            children: [
              Image.asset("images/bagerhat.jpg",
                height: 200,
                width: 400,
                fit: BoxFit.cover,
              ),
              Text('বাগেরহাট জেলা',
                style: TextStyle(fontSize: 25),),
              Text('সুন্দরবনে বাঘের বাস দাড়টানা ভৈরব পাশ সবুজ শ্যামলে ভরা নদী বাঁকে বসতো যে হাট তার নাম বাগের হাট। এক সময় বাগেরহাটের নাম ছিল খলিফাতাবাদ বা প্রতিনিধির শহর। খানজাহান আলী (রঃ) গৌড়ের সুলতানদের প্রতিনিধি হিসেবে এ অঞ্চল শাসন করতেন। কেউ কেউ মনে করেন, বরিশালের শাসক আঘা বাকের এর নামানুসারে বাগেরহাট হয়েছে। কেউবা বলেন, পাঠান জায়গীদার বাকির খাঁ এর নামানুসারে বাগেরহাট হয়েছে। আবার কারো মতে, বাঘ শব্দ হতে বাগেরহাট নাম হয়েছে। জনশ্রুতি আছে খানজাহান আলী (রঃ) এর একটি বাগ(বাগান, ফার্সী শব্দ) বা বাগিচা ছিল। এ বাগ শব্দ হতে বাগেরহাট। কাো মতে, নদীর বাঁকে হাট বসতো বিধায় বাঁকেরহাট। বাঁকেরহাট হহতে বাগেরহাট।',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত খাবার',
                style: TextStyle(fontSize: 25),),
              Text(' (১) চিংড়ি'
                   ' (২) সুপারি',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত স্থান',
                style: TextStyle(fontSize: 25),),
             Text(' (১) ষাট গম্বুজ মসজিদ'
                  ' (২) খানজাহান আলীর (রহ.) মাজার'
                  ' (৩) সিঙ্গাইর মসজিদ'
                  ' (৪) বিবি বেগনী মসজিদ'
                  ' (৫) চুনখোলা মসজিদ'
                  ' (৬) পীর আলী মুহাম্মদ তাহেরের সমাধি'
                  ' (৭) এক গম্বুজ মসজিদ'
                  ' (৮) নয় গম্বুজ মসজিদ'
                  ' (৯) সাবেক ডাঙ্গা পুরাকীর্তি'
                  ' (১০) রণবিজয়পুর মসজিদ'
                  ' (১১) জিন্দাপীর মসজিদ'
                  ' (১২) রেজা খোদা মসজিদ'
                  ' (১৩) খানজাহানের বসতভিটা'
                  ' (১৪) ঢিবি'
                  ' (১৫) কোদলা মঠ'
                  ' (১৬) ইংরেজ শাসনের বিরুদ্ধে বিদ্রোহী শহীদ কৃষক রহিমুল্লাহর বাড়ি'
                  ' (১৭) মোরেলের স্মৃতিসৌধ'
                  ' (১৮) ১৮৬৩ সালে তৎকালীন এসডিও মংলা পোর্ট'
                  ' (১৯) চিলা চার্চ'
                  ' (২০) কবি রুদ্র মোহাম্মদ শহীদুল্লাহর সমাধি'
                  ' (২১) প্রফুল্ল ঘোষের বসতবাড়ি'
                  ' (২২) নীলসরোবর'
                  ' (২৩) জমিদার ক্ষিতিষ চন্দ্রের বসতবাড়ির ধ্বংসাবশেষ'
                  ' (২৪) শাহ আউলিয়াবাগ মাজার'
                  ' (২৫) হজরত খানজাহান আলীর (রহ.) সহচর পীর শাহ আউলিয়ার মাজার'
                  ' (২৬) নাটমন্দির'
                  ' (২৭) রামজয় দত্তের কাছারিবাড়ি'
                  ' (২৮) ব্রিটিশ সেনাদের পর্যবেক্ষণ টাওয়ার'
                  ' (২৯) কৃষ্ণমূর্তি'
                  ' (৩০) গোপাল জিউর মন্দির'
                  ' (৩১) লাউপালা'
                  ' (৩২) যাত্রাপুর'
                  ' (৩৩) দুবলার চর'
                  ' (৩৪) কটকা'
                  ' (৩৫) কচিখালি'
                  ' (৩৬) সুন্দরবন',
                style: TextStyle(fontSize: 15),),

            ],
          ),
        ),
      ),

    );
  }
}
