import 'package:flutter/material.dart';
class chandpur extends StatelessWidget {
  const chandpur({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: Text('চাঁদপুর জেলার ইতিহাস'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(18.0),
        child: SingleChildScrollView(
          child: Column(
            children: [
              Image.asset("images/chandpur.jpg",
                height: 200,
                width: 400,
                fit: BoxFit.cover,
              ),
              Text('চাঁদপুর জেলা',
                style: TextStyle(fontSize: 25),),
              Text('১৭৭৯ খ্রিস্টাব্দে ব্রিটিশ শাসনামলে ইংরেজ জরিপকারী মেজর জেমস রেনেল তৎকালনি বাংলার যে মানচিত্র অংকন করেছিলেন তাতে চাঁদপুর নামে এক অখ্যাত জনপদ ছিল। তখন চাঁদপুরের দক্ষিণে নরসিংহপুর নামক ( বর্তমানে যা নদীগর্ভে বিলীন) স্থানে চাঁদপুরের অফিস-আদালত ছিল। পদ্মা ও মেঘনার সঙ্গমস্থল ছিল বতৃমান স্থান থেকে পাওয়া প্রায় ৬০ মাইল দক্ষিণ-পশ্চিমে। মেঘনা নদীর ভাঙ্গাগড়ার খেলায় এ এলাকা বর্তমানে বিলীন। বার ভূঁইয়াদের আমলে চাঁদপুর অঞ্চল বিক্রমপুরের জমিদার চাঁদরায়ের দখলে ছিল। ঐতিহাসিক জে.এম সেনগুপ্তের মতে চাঁদরায়ের নামানুসারে এ অঞ্চলের নাম চাঁদপুর। কথিত আছে চাঁপুরের (কোড়ালিয়া) পুরিন্দপুর মহল্লার চাঁদ ফকিরের নামানুসারে এ অঞ্চলের নাম চাঁদপুর। কারো কারো মতে, শাহ আহমেদ চাঁদ নামে একজন প্রশাষক দিল্লী থেকে পঞ্চদশ শতকে এখানে এসে একটি নদী বন্দর স্থাপন করেছিলেন। তাঁর নামানুসারে চাঁদপুর। ১৮৭৮ সালে প্রথম চাঁদপুর মহকুমার সৃষ্টি হয়। ১৮৯৬ সালের ১ অক্টোবর চাঁদপুর শহরকে পৌরসভা হিসেবে ঘোষণা করা হয়। ১৯৮৪ সালের ১৫ ই ফেব্রুয়ারী চাঁদপুর জেলা হিসেবে আত্মপ্রকাশ করে।',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত খাবার',
                style: TextStyle(fontSize: 25),),
              Text('ইলিশ',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত স্থান',
                style: TextStyle(fontSize: 25),),
             Text(' (১) শ্রী শ্রী জগন্নাথ মন্দির'
                  ' (২) মনসামুড়া'
                  ' (৩) দোয়াটি'
                  ' (৪) সাহারপাড়ের দীঘি'
                  ' (৫) উজানীতে বেহুলার পাটা'
                  ' (৬) তুলাতলি মঠ'
                  ' (৭) সাহেবগঞ্জ নীলকুঠি'
                  ' (৮) লোহাগড় মঠ'
                  ' (৯) রূপসা জমিদারবাড়ি'
                  ' (১০) হাজীগঞ্জ ঐতিহাসিক বড় মসজিদ'
                  ' (১১) হজরত মাদ্দা খাঁ (রহ.) মসজিদ'
                  ' (১২) বলাখাল জমিদারবাড়ি'
                  ' (১৩) নাসিরকোর্ট শহীদ মুক্তিযোদ্ধা সমাধিস্থল'
                  ' (১৪) নাগরাজাদের বাড়ি'
                  ' (১৫) মঠ ও দীঘি'
                  ' (১৬) নাওড়া'
                  ' (১৭) শাহরাস্তির (রহ.) মাজার'
                  ' ও (১৮) তিন গম্বুজ মসজিদ ও প্রাচীন কবর',
                style: TextStyle(fontSize: 15),),
            ],
          ),
        ),
      ),

    );
  }
}
