import 'package:flutter/material.dart';
class coxs_bazar extends StatelessWidget {
  const coxs_bazar({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: Text('কক্সবাজার জেলার ইতিহাস'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(18.0),
        child: SingleChildScrollView(
          child: Column(
            children: [
              Image.asset("images/coxs_bazar.jpg",
                height: 200,
                width: 400,
                fit: BoxFit.cover,
              ),
              Text('কক্সবাজার জেলা',
                style: TextStyle(fontSize: 25),),
              Text('আরব ব্যবসয়ী ও ধর্ম প্রচারকগণ ৮ম শতকে চট্টগ্রাম ও আকিব বন্দরে আগমন করেন। এই দুই বন্দরের মধ্যবর্তী হওয়ায় কক্সবাজার এলাকা আরবদের ঘনিষ্ঠ সংস্পর্শে আসে। নবম শতাব্দীতে কক্সবাজার সহ বৃহত্তর চট্টগ্রাম হরিকেলার রাজা কান্তিদেব দ্বারা শাসিত হয়। ৯৩০ খ্রিস্টাব্দে আরাকান রাজা সুলাত ইঙ্গ চট্টগ্রাম দখল করে নেবার পর থেকে কক্সবাজার আরাকান রাজ্যের অংশ হয়। ১৭৮৪ সালে রার্মারাজ বোধাপায়া আরাকান দখল করে নেয়। ১৭৯৯ সালে বার্মারাজের হাত থেকে বাঁচার জন্য প্রায় ১৩ হাজার আরাকনি কক্সবাজার থেকে পালিয়ে যায়। এদর পূনর্বাসন করার জন্য ইস্ট ইন্ডিয়া কোম্পানি একজন হিরাম কক্সকে নিয়োগ করে। পূনর্বাসন প্রক্রিয়া শেষ হবার পূর্বেই হিরাম কক্স মৃত্যু বরণ করেন। পূনর্বাসন প্রক্রিয়ায় তাঁর অবদানের জন্য কক্স-বাজার নামক একটি বাজার প্রতিষ্ঠিত হয়েছিল। এই কক্স-বাজার থেকে কক্সবাজার নামের উৎপত্তি।',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত খাবার',
                style: TextStyle(fontSize: 25),),
              Text('মিষ্টিপান',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত স্থান',
                style: TextStyle(fontSize: 15),),
              Text('সমুদ্র সৈকত'
                  'হিমছড়ি'
                  'অগে্গ্মধা ক্যাং'
                  'আদিনাথ মন্দির'
                  'সোনাদিয়া দ্বীপ'
                  'রামকোট তীর্থধাম'
                  'লামারপাড়া ক্যাং'
                  'ইনানী'
                  'প্রবালদ্বীপ সেন্টমার্টিন'
                  'মাথিনের কূপ'
                  'বঙ্গবন্ধু সাফারি পার্ক'
                  'কুতুবদিয়া বাতিঘর'
                  'হারবাং'
                  'ছেঁড়াদ্বীপ'
                  'মহেশখালী জেটি'
                  'রাডার স্টেশন ও লাইট হাউস'
                  'নাইক্ষ্যংছড়ি লেক ও ঝুলন্ত সেতু'
                  'কানা রাজার সুড়ঙ্গ',
                style: TextStyle(fontSize: 25),),
            ],
          ),
        ),
      ),

    );
  }
}
