import 'package:flutter/material.dart';
class gopalganj extends StatelessWidget {
  const gopalganj({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('গোপালগঞ্জ জেলার ইতিহাস'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(18.0),
        child: SingleChildScrollView(
          child: Column(
            children: [
              Image.asset("images/gopalgonj.png",
                height: 200,
                width: 400,
                fit: BoxFit.cover,
              ),
              Text('গোপালগঞ্জ জেলা',
                style: TextStyle(fontSize: 25),),
              Text('গোপালগঞ্জ জেলা শহরের রয়েছে প্রাচীন ইতিহাস। অতীতের রাজগঞ্জ বাজার আজকের জেলা শহর গোপালগঞ্জ। আজ থেকে প্রায় শতাব্দীকাল পূর্বে শহর বলতে যা বুঝায় তার কিছুই এখানে ছিলোনা। এর পরিচিতি ছিলো শুধু একটি ছোট্ট বাজার হিসেবে। এঅঞ্চলটি মাকিমপুর ষ্টেটের জমিদার রানী রাসমণির এলাকাধীন ছিলো। উল্লেখ্য রানী রাসমণি একজন জেলের মেয়ে ছিলেন। সিপাই মিউটিনির সময় তিনি একজন উচ্চ পদস্থ ইংরেজ সাহেবের প্রাণ রক্ষা করেন। পরবর্তীতে তারই পুরস্কার হিসাবে বৃটিশ সরকার রাসমণিরকে মাকিমপুর ষ্টেটের জমিদারী প্রদার করেন এবং তাঁকে রানী উপাধিতে ভূষিত করেন। রানী রাসমণির এক নাতির নাম ছিলো নব-গোপাল তিনি তাঁর স্নেহাস্পদ নাতির নাম এবং পুরানো ইতিহাসকে স্মরণীয় করে রাখার জন্য নাতিন নামের ‘গোপাল’ অংশটি প্রথমে রেখে তার সাথে রাজগঞ্জের ‘গঞ্জ’ যোগ করে এ জাযগাটির নতুর নামকরণ করেন গোপালগঞ্জ। ১৯৮৪ সালে ফরিদপুর জেলার মহকুমা থেকে গোপালগঞ্জ জেলা সৃষ্টি হয়।',
                style: TextStyle(fontSize: 15),),

              Text('বিখ্যাত স্থান',
                style: TextStyle(fontSize: 25),
              ),
             Text(' (১) বঙ্গবন্ধু সমাধিসৌধ'
                  ' (২) কোর্ট মসজিদ'
                  ' (৩) ওড়াকান্দি ঠাকুর বাড়ি'
                  ' (৪) জমিদার গিরীশ চন্দ্র সেনের বাড়ী'
                  ' (৫) অন্যন্যা চন্দ্র ঘাট'
                  ' (৬) গোপালগঞ্জের চান্দার বিল'
                  ' (৭) বিলরুট ক্যানেল'
                  ' (৮) শুকদেবের আশ্রম'
                  ' (৯) খানার পাড় দীঘি'
                  ' (১০) উলপুর জমিদার বাড়ী'
                  ' (১১) মধুমতি বাওড়'
                  ' (১২) সখীচরন রায়ের বাড়ি'
                  ' (১৩) আড়পাড়া মুন্সিবাড়ী'
                  ' (১৪) খাগাইল গায়েবী মসজিদ'
                  ' (১৫) থানা পাড়া জামে মসজিদ'
                  ' (১৬) রামদিয়া চন্দ্রনাথ বসুর আশ্রম'
                  ' (১৭) ৭১ এর বধ্যভূমি স্মৃতিসৌধ (স্মৃতিস্তম্ভ)'
                  ' (১৮) শুকদেবের আশ্রম'
                  ' (১৯) সর্বজনীন কালিমন্দির'
                  ' (২০) সেন্ট মথুরানাথ এজি চার্চ'
                  ' (২১) কবি সুকান্ত ভট্টাচার্যের পৈত্রিকবাড়ী',
                style: TextStyle(fontSize: 15),),
            ],
          ),
        ),
      ),

    );
  }
}
