import 'package:flutter/material.dart';
class kishoreganj extends StatelessWidget {
  const kishoreganj({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: Text('কিশোরগঞ্জ জেলার ইতিহাস'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(18.0),
        child: SingleChildScrollView(
          child: Column(
            children: [
              Image.asset("images/kisurgonj.png",
                height: 200,
                width: 400,
                fit: BoxFit.cover,
              ),
              Text('কিশোরগঞ্জ জেলা',
                style: TextStyle(fontSize: 25),),
              Text('১৮৬০ খ্রিস্টাব্দে কিশোরগঞ্জ মহকুমার জন্ম হয়। মহকুমার প্রথম প্রশাসক ছিলেন মিঃ বকসেল। বর্তমান কিশোরগঞ্জ তৎকালীন জোয়ার হোসেনপুর পরগনার অন্তর্ভক্ত ছিল। অষ্টাদশ শতাব্দীর শেষ দিকেও কিশোরগঞ্জ এলাকা ’কাটখালী’ নামে পরিচিত ছিল। ইতিহাসবিদদের ধারণা ও জনশ্রুতি মতে এ জেলার জমিদার ব্রজকিশোর মতান্তরে নন্দকিশোর প্রামানিকের ’কিশোর’ এবং তাঁর প্রতিষ্ঠিত হাট বা গঞ্জের ’গঞ্জ’ যোগ করে কিশোরগঞ্জ নামকরণ করা হয়।',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত খাবার',
                style: TextStyle(fontSize: 15),
              ),
              Text('বালিশ মিষ্টি',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত স্থান',
                style: TextStyle(fontSize: 25),),
              Text('(১)ঈশা খাঁর জঙ্গলবাড়ি'
                  ' (২) এগারসিন্ধুর দুর্গ'
                  ' (৩) কবি চন্দ্রাবতীর শিবমন্দির'
                  ' (৪) দিল্লির আখড়া'
                  ' (৫) শোলাকিয়া ঈদগাহ'
                  ' (৬) পাগলা মসজিদ'
                  ' (৭) ভৈরব সেতু'
                  ' (৮) হাওরাঞ্চল'
                  ' (৯) সুকুমার রায়ের বাড়ি'
                  ' (১০) জহুরুল ইসলাম মেডিকেল কলেজ'
                  ' (১১) দুর্জয় স্মৃতিভাস্কর্য'
                  ' (১২) নিকলীর হাওর'
                  ' (১৩) সালংকা জামে মসজিদ (পাকুন্দিয়া)'
                  ' (১৪) কুতুব শাহ মসজিদ (অষ্টগ্রাম)'
                  ' (১৫) জাওয়ার সাহেব বাড়ী (তাড়াইল)'
                  ' (১৬) নিরগিন শাহর মাজার'
                  ' (১৭) শাহ গরীবুল্লার মজার (পাকুন্দিয়া)'
                  ' (১৮) হযরত শামছুদ্দীন বোখারীর মাজার (কটিয়াদী )'
                  ' (১৯) মঠখলা কালী মন্দির (পাকুন্দিয়া)'
                  ' (২০) শ্রীশ্রী শ্যাম সুন্দর লক্ষী নারায়ন জিউর আখড়া (সদর)'
                  ' (২১) প্রামাণিক বাড়ী'
                  ' (২২) গাঙ্গাটিয়া জমিদার বাড়ী'
                  ' (২৩) হিলচিয়া সহয়নী বৌদ্ধ (বাজিতপুর)',
                style: TextStyle(fontSize: 15),),
            ],
          ),
        ),
      ),

    );
  }
}
