import 'package:flutter/material.dart';
class manikganj extends StatelessWidget {
  const manikganj({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: Text('মানিকগঞ্জ জেলার ইতিহাস'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(18.0),
        child: SingleChildScrollView(
          child: Column(
            children: [
              Image.asset("images/manikgonj.png",
                height: 200,
                width: 400,
                fit: BoxFit.cover,
              ),
              Text('মানিকগঞ্জ জেলা',
                style: TextStyle(fontSize: 25),),
              Text('মূরত সংস্কৃত ’মানিক্য’ শব্দ থেকে মানিক শব্দটি এসেছে। মানিক হচ্ছে চুনি পদ্মরাগ। গঞ্জ শব্দটি ফরাসী। মানিকগঞ্জের নামের ঋৎপত্তি ইতিহাস আজও রহস্যবৃত। অষ্টাদশ শতকের প্রথমার্ধে সুফি দরবেশ মানিক শাহ সিংগাইর উপজেলার মানিকনগরে আসেন এবং খানকা প্রতিষ্ঠা করে ইসলাম ধর্ম প্রচার শুরু করেন।কারও মতে দূর্ধর্ষ পাঠান সর্দার মানিক ঢালীর নামানুসারে মানিকগঞ্জ নামের উৎপত্তি। আবার কারো মতে, নবাব সিরাজ উদ-দৌলার বিশাবাস ঘাতক মানিক চাঁদের প্রতি কৃতজ্ঞতা স্বরূপ তার নমানুসারে ১৮৪৫ সালের মে মাসে মানিকগঞ্জ মহকুমার নামকরণ হয়। মানিকগঞ্জ মহকুমার নামকরণ সম্পর্কীত উল্লেখ্য তিনটি পৃথক স্থানীয় জনশ্রুতি এবং অনুমান নির্ভর। এর কোন ঐতিহাসিক ভিত্তি পাওয়া যায়নি, তবে মানিক শাহের নামানুসারে মানিকগঞ্জ মহকুমার নামকরণ সম্পর্কীত জনশ্রুতি এবং ঘটনা প্রবাহ থেকে যে চিত্র পাওয়া যায় তাই সঠিক বলে ধরা হয়।',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত খাবার',
                style: TextStyle(fontSize: 25),
              ),
              Text('খেজুর গুড়',
                style: TextStyle(fontSize: 15),),
              Text('বিখ্যাত স্থান',
                style: TextStyle(fontSize: 25),),
              Text('(১) তেওতা জমিদারবাড়ি'
                  ' (২) বালিয়াটি প্রাসাদ'
                  ' (৩) তেওতা নবরত্ন মঠ'
                  ' (৪) মানিকগঞ্জের মত্তের মঠ'
                  ' (৫) রামকৃষ্ণ মিশন সেবাশ্রম'
                  ' (৬) শিব সিদ্ধেশ্বরী মন্দির'
                  ' (৭) শ্রী শ্রী আনন্দময়ী কালীবাড়ি'
                  ' (৮) গৌরাঙ্গ মঠ'
                  ' (৯) নারায়ণ সাধুর আশ্রম'
                  ' (১০) মাচাইন গ্রামের ঐতিহাসিক মাজার ও পুরনো মসজিদ'
                  ' (১১) বাঠইমুড়ি মাজার'
                  ' (১২) আরিচা ঘাট'
                  ' (১৩) প্রশিকা মানবিক উন্নয়ন কেন্দ্র, কৈট্টা, সাটুরিয়া'
                  ' (১৪) শহীদ রফিক স্মৃতি যাদুঘর, সিঙ্গাইর'
                  ' (১৫) কবিরাজ বাড়ী'
                  ' (১৬) ঈশ্বর চন্দ্র উচ্চ বিদ্যালয়, সাটুরিয়া',
                style: TextStyle(fontSize: 15),),
            ],
          ),
        ),
      ),

    );
  }
}
